In [1]:
import numpy
import pandas as pd

In [2]:
dict1 = {
  "name":['Arya','Partha','Harry','rohan'],
  "marks":[92,13,14,15],
  "city":['ramnagar','kolkata','bareilly','antarctica']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks        city
0    Arya     92    ramnagar
1  Partha     13     kolkata
2   Harry     14    bareilly
3   rohan     15  antarctica

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends2.csv',index=False)

In [7]:
df.head(2)

     name  marks      city
0    Arya     92  ramnagar
1  Partha     13   kolkata

In [8]:
df.tail(2)

    name  marks        city
2  Harry     14    bareilly
3  rohan     15  antarctica

In [9]:
df.describe()

           marks
count   4.000000
mean   33.500000
std    39.008546
min    13.000000
25%    13.750000
50%    14.500000
75%    34.250000
max    92.000000

In [10]:
train = pd.read_csv('Train.csv')

In [11]:
train

   Train No  Speed        city
0     17394    912    ramnagar
1     57457    133     kolkata
2     45644    143    bareilly
3     23322    155  antarctica

In [13]:
train['Speed']

0    912
1    133
2    143
3    155
Name: Speed, dtype: int64

In [15]:
train['Speed'][0]

912

In [17]:
train['Speed'][0] = 121 # it will just show a worning but will work

C:\Users\Aryak\AppData\Local\Temp\ipykernel_11016\1709061753.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['Speed'][0] = 121 # it will just show a worning but will work

In [18]:
train

   Train No  Speed        city
0     17394    121    ramnagar
1     57457    133     kolkata
2     45644    143    bareilly
3     23322    155  antarctica

In [19]:
train.to_csv('Train.csv')

In [21]:
train

   Train No  Speed        city
0     17394    121    ramnagar
1     57457    133     kolkata
2     45644    143    bareilly
3     23322    155  antarctica